; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v1 - type_3 ?v6 - type_1)
 	      (pred_3 ?v2 - object ?v6 - type_1)
	      (pred_2 ?v1 - type_3 ?v3 - type_2)
	      (pred_4 ?v1 - type_3 ?v2 - object ?v3 - type_2))

   (:action op_2
       :parameters  (?v1 - type_3 ?v7 ?v4 - type_1)
       :precondition (and  (pred_1 ?v1 ?v7))
       :effect (and  (pred_1 ?v1 ?v4)
		     (not (pred_1 ?v1 ?v7))))

   (:action op_3
       :parameters (?v1 - type_3 ?v8 - object ?v5 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v8 ?v5) (pred_1 ?v1 ?v5) (pred_2 ?v1 ?v3))
       :effect (and (pred_4 ?v1 ?v8 ?v3)
		    (not (pred_3 ?v8 ?v5)) 
		    (not (pred_2 ?v1 ?v3))))

   (:action op_1
       :parameters (?v1 - type_3 ?v8 - object ?v5 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v8 ?v3) (pred_1 ?v1 ?v5))
       :effect (and (pred_3 ?v8 ?v5)
		    (pred_2 ?v1 ?v3)
		    (not (pred_4 ?v1 ?v8 ?v3)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_02 - type_3
obj_10 obj_03 - type_2
obj_09 obj_06 obj_05 obj_07 - type_1
obj_01 obj_04 obj_08 - object)
(:init
(pred_1 obj_02 obj_07)
(pred_2 obj_02 obj_10)
(pred_2 obj_02 obj_03)
(pred_3 obj_01 obj_05)
(pred_3 obj_04 obj_09)
(pred_3 obj_08 obj_06)
)
(:goal
(and
(pred_3 obj_01 obj_05)
(pred_3 obj_04 obj_07)
(pred_3 obj_08 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_02 ?b obj_03))))
)
)

; plan
1. (op_2 obj_02 obj_07 obj_09)
   deleted: (pred_1 obj_02 obj_07)
   added: (pred_1 obj_02 obj_09)
   goals met: 1 of 3
2. (op_3 obj_02 obj_04 obj_09 obj_10)
   deleted: (pred_3 obj_04 obj_09) (pred_2 obj_02 obj_10)
   added: (pred_4 obj_02 obj_04 obj_10)
   goals met: 1 of 3
3. (op_2 obj_02 obj_09 obj_07)
   deleted: (pred_1 obj_02 obj_09)
   added: (pred_1 obj_02 obj_07)
   goals met: 1 of 3
4. (op_1 obj_02 obj_04 obj_07 obj_10)
   deleted: (pred_4 obj_02 obj_04 obj_10)
   added: (pred_3 obj_04 obj_07) (pred_2 obj_02 obj_10)
   goals met: 2 of 3
5. (op_2 obj_02 obj_07 obj_06)
   deleted: (pred_1 obj_02 obj_07)
   added: (pred_1 obj_02 obj_06)
   goals met: 2 of 3
6. (op_3 obj_02 obj_08 obj_06 obj_10)
   deleted: (pred_3 obj_08 obj_06) (pred_2 obj_02 obj_10)
   added: (pred_4 obj_02 obj_08 obj_10)
   goals met: 2 of 3
7. (op_2 obj_02 obj_06 obj_07)
   deleted: (pred_1 obj_02 obj_06)
   added: (pred_1 obj_02 obj_07)
   goals met: 2 of 3
8. (op_1 obj_02 obj_08 obj_07 obj_10)
   deleted: (pred_4 obj_02 obj_08 obj_10)
   added: (pred_3 obj_08 obj_07) (pred_2 obj_02 obj_10)
   goals met: 3 of 3
